---
kind: method
id: M:Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.GetCurveLoop
source: html/de84f566-bb55-1b4b-bc0b-5375076a6507.htm
---
# Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo.GetCurveLoop Method

Gets the CurveLoop representing the base profile curve loop of the roof or floor slab

## Syntax (C#)
```csharp
public CurveLoop GetCurveLoop()
```

## Returns
The CurveLoop.